In [1]:
import pandas as pd
import scipy
import numpy as np
from scipy import stats

Q.1 A F&B manager wants to determine whether there is any significant difference in the diameter of the cutlet between two units. A randomly selected sample of cutlets was collected from both units and measured? Analyze the data and draw inferences at 5% significance level. Please state the assumptions and tests that you carried out to check validity of the assumptions.
datasets=cutlets

In [2]:
data=pd.read_csv("C:/Users/NAMRATA/Downloads/DATA SCIENCE/ASSIGNMENT/hypothesis/Cutlets.csv")
data.head()

   Unit A  Unit B
0  6.8090  6.7703
1  6.4376  7.5093
2  6.9157  6.7300
3  7.3012  6.7878
4  7.4488  7.1522

In [ ]:
"""""
According to the question the bussiness problem is weather there is difference between samples of unit A and unit B
H0=Unit A-UnitB =0
(null hypothesis) there is no difference
H1=Unit A -Unit B !=0
(alternative hypothesis) there is difference.
 According to hypothesis this is a 2 tailed 2 sample test
 """

In [ ]:
# 2 sample 2 tail test

In [4]:
stats.ttest_ind(data['Unit A'],data['Unit B'])

Ttest_indResult(statistic=0.7228688704678061, pvalue=0.4722394724599501)

In [5]:
diff=data['Unit A']-data['Unit B']
diff

0     0.0387
1    -1.0717
2     0.1857
3     0.5134
4     0.2966
5     0.5761
6    -0.3457
7     0.4015
8    -0.5562
9    -0.2267
10    0.5120
11    0.1110
12    0.1594
13    0.8876
14   -0.5784
15   -0.1846
16   -0.0702
17   -0.1609
18   -0.0242
19    0.6017
20    0.0549
21   -0.2660
22    0.0124
23    0.1166
24    0.2358
25   -0.0831
26    0.2030
27   -0.2381
28    0.6085
29   -0.4607
30   -0.3198
31    0.1603
32    0.4596
33    0.8163
34   -0.4470
dtype: float64

In [ ]:
""""
 As the p value of the test is greater than 0.05(significance level),so we will accepet null hypothesis.
  Saying that there is no major difference between samples of unit A and unit B.
  """

Q.2 A hospital wants to determine whether there is any difference in the average Turn Around Time (TAT) of reports of the laboratories on their preferred list. They collected a random sample and recorded TAT for reports of 4 laboratories. TAT is defined as sample collected to report dispatch.
   
  Analyze the data and determine whether there is any difference in average TAT among the different laboratories at 5% significance level.
  dataset=labtat

In [6]:
tat=pd.read_csv('C:/Users/NAMRATA/Downloads/DATA SCIENCE/ASSIGNMENT/hypothesis/LabTAT.csv')
tat.head()

   Laboratory 1  Laboratory 2  Laboratory 3  Laboratory 4
0        185.35        165.53        176.70        166.13
1        170.49        185.91        198.45        160.79
2        192.77        194.92        201.23        185.18
3        177.33        183.00        199.61        176.42
4        193.41        169.57        204.63        152.60

In [ ]:
""""
As there are more than 2 samples here we use anova test to find weather there is difference between average of the business problem the hypothesis is
H0:mean1=mean2=mean3=mean4(there is no major difference or variance in the sample means)
H1:Atleast one mean is different.
Here we use anova test hypothesis
"""

In [ ]:
#Anova test hypothesis

In [8]:
import scipy.stats as stats
stats.f_oneway(tat['Laboratory 1'],tat['Laboratory 2'],tat['Laboratory 3'],tat['Laboratory 4'])

F_onewayResult(statistic=118.70421654401437, pvalue=2.1156708949992414e-57)

In [9]:
tat.mean()

Laboratory 1    178.361583
Laboratory 2    178.902917
Laboratory 3    199.913250
Laboratory 4    163.682750
dtype: float64

In [ ]:
""""
above we can see that the p value is lessthan 0.05(significant level)
as p is low we reject the null hypothesis
It states that there is difference or variance in the average of the samples
""""

Q.3 Sales of products in four different regions is tabulated for males and females. Find if male-female buyer rations are similar across regions.

In [10]:
buyer=pd.read_csv('C:/Users/NAMRATA/Downloads/DATA SCIENCE/ASSIGNMENT/hypothesis/BuyerRatio.csv')
buyer

  Observed Values  East  West  North  South
0           Males    50   142    131     70
1         Females   435  1523   1356    750

In [ ]:
""""
Here we need to find weather t he male-female buyers rations are similar or not acorss the regions.
as we need to find is there an y relation and different regions.
here
H0=independent variables(samples ration are not dependent on regions)
Ha=Dependent variables (samples ration is dependent on regions)
so,for this we are using chi-square test for computation.
""''

In [ ]:
#chi-square test

In [11]:
male=[50,142,131,70]
female=[435,1523,1356,750]
sales=[[male,female]]

In [14]:
chi2=stats.chi2_contingency(sales)
chi2 #t-statistics,p-value,degree of freedom

(1.595945538661058,
 0.6603094907091882,
 3,
 array([[[  42.76531299,  146.81287862,  131.11756787,   72.30424052],
         [ 442.23468701, 1518.18712138, 1355.88243213,  747.69575948]]]))

In [15]:
chi2[1]  #This the p value for the test

0.6603094907091882

In [16]:
buyer.mean()

East     242.5
West     832.5
North    743.5
South    410.0
dtype: float64

In [ ]:
""""
As the p value is greater than 0.05(significance level),we accept Null hypothesis i.e,there is no
dependance between the sales ration and regions.
so the sales rations are not similar across the regions.
"""""

Q.4 TeleCall uses 4 centers around the globe to process customer order forms. They audit a certain %  of the customer order forms. Any error in order form renders it defective and has to be reworked before processing.  The manager wants to check whether the defective %  varies by centre. Please analyze the data at 5% significance level and help the manager draw appropriate inferences

In [17]:
d=pd.read_csv('C:/Users/NAMRATA/Downloads/DATA SCIENCE/ASSIGNMENT/hypothesis/Costomer+OrderForm.csv')
d

    Phillippines   Indonesia       Malta       India
0     Error Free  Error Free   Defective  Error Free
1     Error Free  Error Free  Error Free   Defective
2     Error Free   Defective   Defective  Error Free
3     Error Free  Error Free  Error Free  Error Free
4     Error Free  Error Free   Defective  Error Free
..           ...         ...         ...         ...
295   Error Free  Error Free  Error Free  Error Free
296   Error Free  Error Free  Error Free  Error Free
297   Error Free  Error Free   Defective  Error Free
298   Error Free  Error Free  Error Free  Error Free
299   Error Free   Defective   Defective  Error Free

[300 rows x 4 columns]

In [ ]:
""""
As these are categorical data and we need to find relation between then,so we chi-square test
 Here hypothesis is
 H0:independent variables
 Ha:dependent variables
 """

In [ ]:
#chi-squre test

In [18]:
p=d.Phillippines.value_counts()
pd.DataFrame(p)

            Phillippines
Error Free           271
Defective             29

In [19]:
i=d.Indonesia.value_counts()
pd.DataFrame(i)

            Indonesia
Error Free        267
Defective          33

In [20]:
m=d.Malta.value_counts()
pd.DataFrame(m)

            Malta
Error Free    269
Defective      31

In [21]:
b=d.India.value_counts()
pd.DataFrame(b)

            India
Error Free    280
Defective      20

In [22]:
error_free=[271,267,269,280]
defective=[29,33,31,20]
t=[[error_free,defective]]

In [25]:
test=stats.chi2_contingency(t)
test # t-statistic, p-value, degree of freedom

(3.858960685820355,
 0.2771020991233135,
 3,
 array([[[271.75, 271.75, 271.75, 271.75],
         [ 28.25,  28.25,  28.25,  28.25]]]))

In [26]:
test[1] #p value of the test

0.2771020991233135

In [ ]:
""""
As the p-value >0.05(significance level):we accept Null hypothesis i.e independent variables.
so, the defective %does not variables at center.
""""